[
  {
    "title": "This is first post",
    "body": "It is my first post. do you like it?"
  },

  {
    "title": "Quantum compiling by deep reinforcement learning",
    "body": "The general problem of quantum compiling is to approximate any unitary transformation that describes the quantum computation as a sequence of elements selected from a finite base of universal quantum gates. The Solovay-Kitaev theorem guarantees the existence of such an approximating sequence. Though, the solutions to the quantum compiling problem suffer from a tradeoff between the length of the sequences, the precompilation time, and the execution time. Traditional approaches are time-consuming, unsuitable to be employed during computation. Here, we propose a deep reinforcement learning method as an alternative strategy, which requires a single precompilation procedure to learn a general strategy to approximate single-qubit unitaries. We show that this approach reduces the overall execution time, improving the tradeoff between the length of the sequence and execution time, potentially allowing real-time operations."
  },

  {
    "title": "The effect of ultrasmall grain sizes on the thermal conductivity of nanocrystalline silicon thin films",
    "body": "Nanocrystallization has been an important approach for reducing thermal conductivity in thermoelectric materials due to limits on phonon mean-free path imposed by the characteristic structural size. We report on thermal conductivity as low as 0.3 Wm−1K−1 of nanocrystalline silicon thin films prepared by plasma-enhanced chemical-vapor deposition as grain size is reduced to 2.8 nm by controlling hydrogen dilution of silane gas during growth. A multilayered film composed by alternating growth conditions, with layer thicknesses of 3.6 nm, is measured to have a thermal conductivity 30% and 15% lower than its two constituents. Our quantitative analysis attributes the strong reduction of thermal conductivity with decreasing grain size to the magnifying effect of porosity which occurs concomitantly due to increased mass density fluctuations. Our results demonstrate that ultrasmall grain sizes, multilayering, and porosity, all at a similar nanometer-size scale, may be a promising way to engineer thermoelectric materials."
  }
]
